Сценарий добавления в избранное
======
### Цель
Для быстрого доступа и заказа пиццы клиент может сохранить в **список избранных** понравившиеся пиццы.

### Основной сценарий 

1. В каталоге пиццы *клиент отмечает понравившиеся пиццы*, топпинги или их сочетания 
2. Система сохраняет **список избранных** товаров и отображает его в отдельном разделе в личном кабинете (профиле) клиента 
3. Клиент переходит в **список избранных** для просмотра или выбора пиццы для заказа 

#### Исключения
Если понравившийся товар в списке *более недоступен для заказа* (более не производится) этот **товар удаляется из списка избранных**